Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: Technical Infrastructure
gl: Infraestrutura Técnica

source: Free software projects rely on technologies that support the selective capture and integration of information. The more skilled you are at using these technologies, and at persuading others to use them, the more successful your project will be. This only becomes more true as the project grows. Good information management is what prevents open source projects from collapsing under the weight of Brooks' Law<footnote><para>From his book <citetitle>The Mythical Man Month</citetitle>, 1975. See <ulink url="http://en.wikipedia.org/wiki/The_Mythical_Man-Month"></ulink> and <ulink url="http://en.wikipedia.org/wiki/Brooks_Law"></ulink>.</para></footnote>, which states that adding manpower to a late software project makes it later. Fred Brooks observed that the complexity of a project increases as the <emphasis>square</emphasis> of the number of participants. When only a few people are involved, everyone can easily talk to everyone else, but when hundreds of people are involved, it is no longer possible for each person to remain constantly aware of what everyone else is doing. If good free software project management is about making everyone feel like they're all working together in the same room, the obvious question is: what happens when everyone in a crowded room tries to talk at once?
gl: Os proxectos de software libre apóianse en tecnoloxías que facilitan a captura selectiva e a integración da información. Canto máis habilidoso sexas usando estas tecnoloxías, e persuadindo a outros a empregalas, maior éxito terá o teu proxecto. Esta afirmación só empezará a ser certa segundo vaia medrando o proxecto.Unha boa xestión da información é o que evita que os proxectos de software libre sexan esmagados polo peso da Lei de Brooks<footnote><para>Do seu libro<citetitle>The Mythical Man Month</citetitle>, 1975. Ver <ulink url="http://en.wikipedia.org/wiki/The_Mythical_Man-Month"></ulink> e <ulink url="http://en.wikipedia.org/wiki/Brooks_Law"></ulink>.</para></footnote>, que establece que engadir man de obra a un proxecto que vai con atraso fará que se atrase aínda máis. Fred Brooks observou que a complexidade dun proxecto aumenta a razón do <emphasis>cadrado</emphasis> do número de participantes. Mentres só estiver implicado un número reducido de persoas, cada un pode facilmente comunicarse cos demais; mais cando están implicadas centos de persoas, non é xa.posible que cada persoa permaneza constantemente informada do que están a facer todos os demais. Se o segredo dunha boa xestión dun proxecto de software libre reside en conseguir que todo o mundo sinta que está a traballar cos demais na mesma habitación, a pregunta obvia é: que pasa cando todos os que están nunha habitación abarrotada tratan de falar ao mesmo tempo?

source: This problem is not new. In non-metaphorical crowded rooms, the solution is <firstterm>parliamentary procedure</firstterm>: formal guidelines for how to have real-time discussions in large groups, how to make sure important dissents are not lost in floods of "me-too" comments, how to form subcommittees, how to recognize when decisions are made, etc. An important part of parliamentary procedure is specifying how the group interacts with its information management system. Some remarks are made "for the record", others are not. The record itself is subject to direct manipulation, and is understood to be not a literal transcript of what occurred, but a representation of what the group is willing to <emphasis>agree</emphasis> occurred. The record is not monolithic, but takes different forms for different purposes. It comprises the minutes of individual meetings, the complete collection of all minutes of all meetings, summaries, agendas and their annotations, committee reports, reports from correspondents not present, lists of action items, etc.
gl: Este problema non é novo. En habitacións abarrotadas, reais, a solución consiste en adoptar o denominado<firstterm>procedemento parlamentario</firstterm>: un conxunto de normas formais sobre como manter discusións en tempo real no seo de grandes grupos, como estar seguros de que ningunha.manifestación relevante se perde entre moreas de comentarios tipo "eu tamén", como formar subcomités, cómo estar seguros sobre cando foi tomada unha decisión, etc. Unha parte importante do procedemento parlamentario consiste en determinar como interaxe o grupo co seu sistema de xestión da información. Algúns comentarios son feitos coa vontade de que fiquen rexistrados nos arquivos, outros non. O propio arquivo está suxeito a manipulación directa, e é entendido non coma unha transcrición literal do que ocorreu, se non como a transcrición do que o grupo pretende <emphasis>decidir</emphasis> que ocorreu. Os arquivos non son monolíticos, adoptan diferentes formas para diferentes usos. Comprenden tanto as actas de cada reunión como as coleccións completas de todas as actas de todas as reunións, resumos, axendas e as súas anotacións, informes de comités, informes de colaboradores non presentes nas reunións, listas de temas a tratar, etc.

source: Because the Internet is not really a room, we don't have to worry about replicating those parts of parliamentary procedure that keep some people quiet while others are speaking. But when it comes to information management techniques, well-run open source projects are parliamentary procedure on steroids. Since almost all communication in open source projects happens in writing, elaborate systems have evolved for routing and labeling data appropriately; for minimizing repetitions so as to avoid spurious divergences; for storing and retrieving data; for correcting bad or obsolete information; and for associating disparate bits of information with each other as new connections are observed. Active participants in open source projects internalize many of these techniques, and will often perform complex manual tasks to ensure that information is routed correctly. But the whole endeavor ultimately depends on sophisticated software support. As much as possible, the communications media themselves should do the routing, labeling, and recording, and should make the information available to humans in the most convenient way possible. In practice, of course, humans will still need to intervene at many points in the process, and it's important that the software make such interventions convenient too. But in general, if the humans take care to label and route information accurately on its first entry into the system, then the software should be configured to make as much use of that metadata as possible.
gl: Como Internet non é realmente unha habitación, non temos que preocuparnos de replicar as partes do procedemento parlamentario que teñen a ver con manter unhas persoas caladas mentres outros falan. Mais cando se trata de técnicas de xestión da información, os proxectos de software libre ben xestionados poden compararse a procedementos parlamentarios dopados con esteroides. Dado que nos proxectos de software libre practicamente toda a comunicación se fai por escrito, os sistemas elaborados evoluíron para faceren axeitadamente o seguimento e a etiquetaxe dos datos; cara á minimización das repeticións para evitaren diverxencias espúreas; para o correcto almacenamento e recuperación dos datos; cara a corrixir a información errónea ou obsoleta; e cara a asociación entre si de bits de datos desaparellados en canto se observan novas conexións. Quen participa activamente en proxectos de software libre adopta moitas destas técnicas, e frecuentemente é quen de executar complexas operacións manuais para garantir que a información está a ser xestionada axeitadamente. Mais o traballo completo depende en grande medida da axuda de software sofisticado. Na medida do posible son precisamente as ferramentas de comunicación as que deberían asumir as máis das tarefas de direccionamiento, etiquetaxe, e gravación, e deberían achegarlle a información aos seres humanos da maneira máis axeitada. É obvio que na vida real os seres humanos van ter que intervir en moitas etapas do proceso, e é importante que o software facilite esas intervencións. Mais en xeral, se os seres humanos toman a precaución de etiquetar e encamiñar a información correctamente ao inserila pola primeira vez no sistema, o software debería estar configurado para tirar o máximo partido dos metadatos.

source: The advice in this chapter is intensely practical, based on experiences with specific software and usage patterns. But the point is not just to teach a particular collection of techniques. It is also to demonstrate, by means of many small examples, the overall attitude that will best encourage good information management in your project. This attitude will involve a combination of technical skills and people skills. The technical skills are essential because information management software always requires configuration, plus a certain amount of ongoing maintenance and tweaking as new needs arise (for example, see the discussion of how to handle project growth in <xref linkend="bug-filtering"/><phrase output="printed"> later in this chapter</phrase>). The people skills are necessary because the human community also requires maintenance: it's not always immediately obvious how to use these tools to full advantage, and in some cases projects have conflicting conventions (for example, see the discussion of setting <systemitem>Reply-to</systemitem> headers on outgoing mailing list posts, in <xref linkend="mailing-lists"/>). Everyone involved with the project will need to be encouraged, at the right times and in the right ways, to do their part to keep the project's information well organized. The more involved the contributor, the more complex and specialized the techniques she can be expected to learn.
gl: As recomendacións recollidas neste capítulo son principalmente prácticas, baseadas en experiencias con patróns de software específico e de uso. Mais a cuestión non é aprendervos unha colección particular de técnicas. É tamén a de demostrar, a través do uso de moitos pequenos exemplos, a actitude xeral que mellor se vai adecuar á correcta xestión da información nos vosos proxectos. Esta actitude envolve un conxunto de habilidades técnicas e habilidades persoais. As habilidades técnicas son esenciais dado que o software de xestión da información sempre ten que ser correctamente configurado, ademais de precisar de unha certa cantidade de mantemento permanente e de modificación en canto xurdir unha nova necesidade (como exemplo, botádelle unha ollada á discusión sobre como manexar o crecemento do proxecto en <xref linkend="filtraxe de erros"/><phrase output="printed"> máis adiante neste mesmo capítulo</phrase>). As habilidades persoais son necesarias xa que a comunidade humana tamén require de mantemento: non sempre é inmediatamente obvio o modo de empregar estas ferramentas para obter o mellor rendemento, e nalgúns casos os proxectos adoptan convencións conflitivas (como exemplo, podes ver a discusión sobre a configuración dos cabezallos <systemitem>Reply-to</systemitem> das mensaxes saíntes nas listas de correo ). Todos os que estiveren implicados no proxecto van precisar que, nalgún momento ou noutro e da maneira correcta, se lles force a facer a súa parte do traballo para manter ben organizada a información relativa ao mesmo. Canto máis implicado estiver o colaborador, máis complexas e especializadas serán as técnicas que se espera que aprenda.

source: Information management has no cut-and-dried solution. There are too many variables. You may finally get everything configured just the way you want it, and have most of the community participating, but then project growth will make some of those practices unscalable. Or project growth may stabilize, and the developer and user communities settle into a comfortable relationship with the technical infrastructure, but then someone will come along and invent a whole new information management service, and pretty soon newcomers will be asking why your project doesn't use it&mdash;for example, this is happening now to a lot of free software projects that predate the invention of the wiki (see <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>). Many questions are matters of judgement, involving tradeoffs between the convenience of those producing information and the convenience of those consuming it, or between the time required to configure information management software and the benefit it brings to the project.
gl: Non existen solucións á medida para a xestión da información. Hai demasiadas variables. Podedes ter absolutamente todo configurado da maneira que queredes telo, e coa maioría da comunidade participando xa, mais entón o crecemento do proxecto fará que non sexa posible incrementar una desas prácticas. Ou o crecemento do proxecto pode terse estabilizado, e as comunidades de desenvolvedores e de usuarios manter unha confortable relación coa infraestrutura técnica, mais entón alguén se presentará cunha solución de xestión da información completamente nova, e os recentemente incorporados ao proxecto logo van comezar a preguntar por que non está a ser empregada&mdash; por exemplo, isto está a ocorrer actualmente cunha chea de proxectos de software libre anteriores á invención das wikis (véxase <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>). Moitas decisións dependerán de matices, xa que van ser resoltas mediante compromisos entre os intereses de quen produce a información e os de quen a consume, ou do tempo requirido para configurar o software de xestión da información fronte aos beneficios que este poida achegar ao proxecto.

source: Beware of the temptation to over-automate, that is, to automate things that really require human attention. Technical infrastructure is important, but what makes a free software project work is care&mdash;and intelligent expression of that care&mdash;by the humans involved. The technical infrastructure is mainly about giving humans convenient ways to do that.
gl: Loitade contra a tentación de hiper-automatizar, e dicir, de automatizar procesos que en realidade requiren da atención humana. A infraestrutura técnica é importante, mais o que fai que un proxecto de software libre funcione é o coidado&mdash;e a manifestación intelixente dese coidado&mdash; por parte dos individuos involucrados. A infraestrutura técnica ten a ver principalmente con fornecerlles aos humanos formas convenientes de facelo.

source: What a Project Needs
gl: Que é o que un proxecto precisa

source: Most open source projects offer at least a minimum, standard set of tools for managing information:
gl: Os máis dos proxectos de software de código aberto ofrecen cando menos un conxunto mínimo e estándar de ferramentas para a xestión da información:

source: Web site
gl: Sitio Web

source: Primarily a centralized, one-way conduit of information from the project out to the public. The web site may also serve as an administrative interface for other project tools.
gl: É ante todo un conduto centralizado e unidireccional de transmisión de información desde o proxecto cara ao público. O sitio web pode tamén funcionar como interface administrativa para outras ferramentas do proxecto.

source: Mailing lists
gl: Listas de correo

source: Usually the most active communications forum in the project, and the "medium of record."
gl: Xeralmente constitúen os foros de comunicación máis activos do proxecto, ademais do "medio de arquivamento"

source: Version control
gl: Control de versións

source: Enables developers to manage code changes conveniently, including reverting and "change porting". Enables everyone to watch what's happening to the code.
gl: Permite aos desenvolvedores xestionaren convenientemente as mudanzas no código, incluíndo a reversión e o traslado de mudanzas ("change porting"). Permite tamén que todo o mundo saiba o que se está a facer co código.

source: Bug tracking
gl: Seguimento de erros ("Bug Tracking")

source: Enables developers to keep track of what they're working on, coordinate with each other, and plan releases. Enables everyone to query the status of bugs and record information (e.g., reproduction recipes) about particular bugs. Can be used for tracking not only bugs, but also tasks, releases, new features, etc.
gl: Permite aos desenvolvedores manteren o control sobre aquilo no que están a traballar, coordinárense cos demais e planificaren as publicacións de novas versións. Permite que todos os colaboradores poidan facer consultas sobre o estado en que se atopa a resolución de erros e gravar información (p.e.: procedementos de reprodución) sobre erros concretos. Pode ser usado non só para facer seguimento dos erros, senón tamén de tarefas, versións, novas funcionalidades, etc

source: Real-time chat
gl: Chat en tempo real (IRC)

source: A place for quick, lightweight discussions and question/answer exchanges. Not always archived completely.
gl: É o lugar onde se celebran discusións rápidas e pouco transcendentes e se fan intercambios de preguntas/respostas. Non sempre se arquivan completamente.

source: Each tool in this set addresses a distinct need, but their functions are also interrelated, and the tools must be made to work together. Below we will examine how they can do so, and more importantly, how to get people to use them. The web site is not discussed until the end, since it acts more as glue for the other components than as a tool unto itself.
gl: Cada ferramenta das descritas aborda unha necesidade concreta, mais as súas funcións están inter-relacionadas, e deben estar configuradas de xeito que poidan traballar conxuntamente. Máis adiante examinaremos como facer iso e, máis importante, como conseguir que a xente as empregue. O sitio web non se trata ata o final, dado que actúa máis como aglomerante dos demais compoñentes que como unha ferramenta en si mesma.

source: You may be able to avoid a lot of the headache of choosing and configuring these tools by using a <firstterm>canned hosting</firstterm> site: a server that offers prepackaged, templatized web areas with all the accompanying tools needed to run a free software project. See <xref linkend="canned-hosting"/><phrase output="printed"> later in this chapter</phrase> for a discussion of the advantages and disadvantages of canned hosting.
gl: Podedes evitar moitas das dores de cabeza derivadas da selección e configuración destas ferramentas empregando un sitio web do tipo<firstterm>canned hosting (aloxamento enlatado)</firstterm>: un servidor que ofrece áreas web preempacotadas e regularizadas que conteñen todas as ferramentas necesarias para manexar un proxecto de software libre. Podedes consultar o apartado <xref linkend="canned-hosting (aloxamento enlatado)"/><phrase output="printed"> máis adiante neste capítulo</phrase>, no que se discute sobre as vantaxes e desvantaxes deste tipo de sitios web.

source: Mailing Lists
gl: Listas de Correo

source: Mailing lists are the bread and butter of project communications. If a user is exposed to any forum besides the web pages, it is most likely to be one of the project's mailing lists. But before they experience the mailing list itself, they will experience the mailing list interface&mdash;that is, the mechanism by which they join ("subscribe to") the list. This brings us to Rule #1 of mailing lists:
gl: As listas de correo son o pan e o sal das comunicacións nun proxecto. Se un usuario está exposto a un foro para alén das páxinas web, o máis probable é que se trate dunha das listas de correo do proxecto. Mais antes de chegar a usar as listas en si mesmas, primeiro terán que experimentar o uso das súas interfaces&mdash; é dicir, o mecanismo polo cal se subscriben ("suscribe to") á lista en cuestión. Isto nos leva á Regra nº1 das listas de correo:

source: Don't try to manage mailing lists by hand&mdash;get list management software.
gl: Non tratedes de xerir as listas de correo manualmente&mdash;empregade software de xestión de listas

source: It will be tempting to put this off. Setting up mailing list management software might seem like overkill at first. Managing small, low-traffic lists by hand will seem seductively easy: you just set up a subscription address that forwards to you, and when someone mails it, you add (or remove) their email address in some text file that holds all the addresses on the list. What could be simpler?
gl: Deixar esta regra de lado pode resultar tentador. Configurar software para a xestión das listas pode parecer excesivo. Xestionar listas pequenas, con pouco tráfego de mensaxes a man pode resultar sedutoramente sinxelo: simplemente creas un enderezo de subscrición encamiñado a ti, e cando alguén manda unha mensaxe a ela, ti engades (ou borras) o seu enderezo de email dun arquivo de texto que contén todos os enderezos da lista. Podería ser máis sinxelo?

source: The trick is that good mailing list management&mdash;which is what people have come to expect&mdash;is not simple at all. It's not just about subscribing and unsubscribing users when they request. It's also about moderating to prevent spam, offering the mailing list in digest versus message-by-message form, providing standard list and project information by means of auto-responders, and various other things. A human being monitoring a subscription address can supply only a bare minimum of functionality, and even then not as reliably and promptly as software could.
gl: O truco está en que unha boa xestión da lista de correo&mdash;que é o que a xente espera&mdash;non é sinxela en absoluto. No se trata tan só de subscribir ou dar de baixa os usuarios cando o pediren. Ten tamén a ver con moderala, evitar o spam, ofertar a lista en formato de resumo de mensaxes ou nun formato que mostre todas as mensaxes, fornecer información estándar sobre a lista e o proxecto mediante mensaxes de resposta automática, e moitas outras cousas. Un ser humano que faga seguimento da lista de subscricións e baixas estará a fornecer tan só unha mínima parte das funcionalidades requiridas e, mesmo entón, non en forma tan segura e áxil como o faría o software.

source: Modern list management software usually offers at least the following features:
gl: O software de xestión de listas actual ofrece cando menos as seguintes utilidades:

source: Both email- and web-based subscription
gl: Subscrición tanto por email como a través dunha páxina web

source: When a user subscribes to a list, she should <emphasis>promptly</emphasis> get an automated welcome message in reply, telling her what she has subscribed to, how to interact further with the mailing list software, and (most importantly) how to unsubscribe. This automatic reply can be customized to contain project-specific information, of course, such as the project's web site, FAQ location, etc.
gl: Cando un usuario se subscribe a unha lista debería recibir <emphasis>inmediatamente</emphasis> unha mensaxe automática de benvida, dicíndolle a que se subscribiu, como interaxir en adiante co software de xestión da lista e (moi importante) como darse de baixa. Esta resposta automática pode ser personalizada para que conteña información especifica do proxecto, desde logo, tal como o enderezo da súa páxina web,a localización das FAQ (Frequently Asked Questions = Preguntas Respondidas Frecuentemente), etc

source: Subscription in either digest mode or message-by-message mode
gl: Subscrición en modo "digest" (só resumos das mensaxes) ou en modo de mensaxes completas
